<?php
namespace App\UiPart;


use App\Enum\CategoryEnum;
use App\Enum\ConfigEnum;

class Navbar
{
    public static function getMeta() {?>
        <meta charset="UTF-8">
        <meta name="viewport"
              content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
        <meta http-equiv="X-UA-Compatible" content="ie=edge">
        <link rel="stylesheet" href="assets/css/navbar.css">
        <link rel="stylesheet" href="assets/css/common.css">
        <link rel="stylesheet" href="assets/css/hover.min.css">
        <script src="assets/js/common.js"></script>
        <link rel="stylesheet" href="https://unpkg.com/swiper/swiper-bundle.min.css">
        <script src="https://unpkg.com/swiper/swiper-bundle.min.js"></script>
        <script src="assets/js/navbar.js"></script>
    <?php
    }
    public static function renderNavbar() { ?>
        <header class="top">
            <div class="logo">
                <a href="index.php">
                    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 600 600">
                        <defs>
                            <style>.cls-1{fill:#fff;}</style>
                        </defs>
                        <title>Logo Vance (transparent)</title>
                        <g id="Layer_4_copy" data-name="Layer 4 copy">
                            <path class="cls-1" d="M427.88,303.43c-1.47-3.24-3.94-7.34-6.19-9-1.83-1.46-1.1,2.38-4,4.57s-7.21,4.5-11.41-1.06c-.22-.3-.44-.61-.66-.95-.18-.54-1.27-.73-1.27-.73s-3,8.25-7.87,14.14c-2.68,3.25-5.92,5.79-9.5,5.79a4.69,4.69,0,0,0-.46,2.92,1.86,1.86,0,0,0,.1.37c.54,1.64,6,2.92,12.06,1.64S410,319.66,409.81,316c0-1.46,2.74-3.1,5.12-1.46s14.25-5.12,14.25-7.13A12.87,12.87,0,0,0,427.88,303.43Z"/>
                            <path class="cls-1" d="M409.72,298.13a4.66,4.66,0,0,0,3,.82h0s2.58-.54,1.42-2.56a2.48,2.48,0,0,0-1.82-1s2.26-.62,3.79,2.11c1.66-1.33,2.75-3.17,2.75-3.92a3.31,3.31,0,0,1-2.28.77s3.81-3.05,3-6.86c0,0-2.28,2.29-3.8,2.29a9,9,0,0,0,.76-9.91s-.76,6.86-4.57,9.91S405.15,295.08,409.72,298.13Z"/>
                        </g>
                        <g id="Layer_3" data-name="Layer 3">
                            <path d="M366.43,379.25"/>
                            <path d="M550,50H50V550H550ZM114.67,349.92,78.1,255.54H98.39l24.54,66.3,24.18-66.3h20.06l-35.75,94.38Zm120.57,0L226.51,331H180.74l-8.85,18.88H151.83l44.6-94.38H210.7l44.59,94.38Zm107.94,0H325.25l-42.59-66.18v66.18H264.73V255.54h20.52l40,61.58V255.54h17.93Zm86.76-3.3a48.81,48.81,0,0,1-22.24,5.07A51.16,51.16,0,0,1,372,337.41a48.91,48.91,0,0,1-10.73-15.51,48.72,48.72,0,0,1,0-38.34,49.11,49.11,0,0,1,26.74-26,51.35,51.35,0,0,1,19.7-3.78,48.81,48.81,0,0,1,22.24,5.08,51.3,51.3,0,0,1,16.81,13.21l-12.62,13A33.21,33.21,0,0,0,422.86,275a31.89,31.89,0,0,0-27.6-1.3,33.46,33.46,0,0,0-10.21,6.84,32.53,32.53,0,0,0-6.9,10,29.84,29.84,0,0,0-2.53,12.21,29.48,29.48,0,0,0,2.53,12.09,32.29,32.29,0,0,0,6.9,10,33.28,33.28,0,0,0,10.21,6.84,30.9,30.9,0,0,0,12.44,2.54,30,30,0,0,0,15.46-4,35.26,35.26,0,0,0,11.21-10.44l12.74,13.09A52.46,52.46,0,0,1,429.94,346.62Zm-10.32-59.16c.77,3.81-3,6.86-3,6.86a3.31,3.31,0,0,0,2.28-.77c0,.75-1.09,2.59-2.75,3.92-1.53-2.73-3.79-2.11-3.79-2.11a2.48,2.48,0,0,1,1.82,1c1.16,2-1.42,2.56-1.42,2.56h0a4.66,4.66,0,0,1-3-.82c-4.57-3.05-1.52-5.34,2.29-8.38s4.57-9.91,4.57-9.91a9,9,0,0,1-.76,9.91C417.34,289.75,419.62,287.46,419.62,287.46ZM417.67,299c2.92-2.19,2.19-6,4-4.57,2.25,1.66,4.72,5.76,6.19,9a12.87,12.87,0,0,1,1.3,4c0,2-11.88,8.78-14.25,7.13s-5.12,0-5.12,1.46c.18,3.66-5.12,3.84-11.15,5.12s-11.52,0-12.06-1.64a1.86,1.86,0,0,1-.1-.37,4.69,4.69,0,0,1,.46-2.92c3.58,0,6.82-2.54,9.5-5.79,4.84-5.89,7.87-14.14,7.87-14.14s1.09.19,1.27.73c.22.34.44.65.66.95C410.46,303.5,414.89,301.09,417.67,299ZM519,270.76H474.59v22.53h43.77V308H474.59V334H519v15.93H456.66V255.66H519Z"/>
                            <polygon points="187.7 315.83 219.31 315.83 203.62 281.85 187.7 315.83"/>
                            <path d="M0,0V600H600V0ZM570,570H30V30H570Z"/>
                        </g>
                    </svg>
                </a>
            </div>
            <nav>
                <ul>
                    <li>
                        <a href="index.php">
                            Strona główna
                        </a>
                    </li>
                    <?php foreach (CategoryEnum::getCategories() as $category) { ?>
                        <li>
                            <a href="category.php?cat=<?= $category['slug'] ?>">
                                <?= $category['name'] ?>
                            </a>
                        </li>
                    <?php } ?>
                    <li>
                        <a href="contact.php">
                            Kontakt
                        </a>
                    </li>
                    <li>
                        <a href="about.php">
                            O nas
                        </a>
                    </li>
                </ul>
            </nav>
        </header>
    <?php }
}